---
kind: other
id: Properties.T:Autodesk.Revit.DB.KeyBasedTreeEntryError
source: html/b54c8486-e61f-3249-7780-6aed2dffe4a9.htm
---
# KeyBasedTreeEntryError Properties

Indicates which of possible types of problems with loading and/or building
 a KeyBasedTreeEntries that this KeyBasedTreeEntryError represents.